app/Controllers/ReportController.php


        // 🔹 Fetch distinct departments
    $deptBuilder = $db->table('visitor_request_header');
    $departments = $deptBuilder
        ->select('DISTINCT(department) as department')
        ->where('department IS NOT NULL')
        ->orderBy('department', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT DISTINCT(department) as department
FROM `visitor_request_header`
WHERE `department` IS NOT NULL
ORDER BY `department` ASC