app/Controllers/SecurityController.php

SELECT *
FROM `departments`
---
     public function View_authorized_visitor_list()
    {
          $deptModel = new DepartmentModel();
          $data['departments'] = $deptModel->findAll();

SELECT *
FROM `visitors`
WHERE `v_code` = 'V000032'
 LIMIT 1
SELECT *
FROM `security_gate_logs`
WHERE `visitor_request_id` = '32'
AND check_out_time IS NULL
 LIMIT 1
---
    public function securityAction()
    {
        date_default_timezone_set('Asia/Kolkata');

        $logModel     = new \App\Models\SecurityGateLogModel();
        $visitorModel = new \App\Models\VisitorRequestModel();
        $v_code = $this->request->getPost('v_code');

        // 🔹 Validate V-Code
        $visitor = $visitorModel->where('v_code', $v_code)->first();

        if (!$visitor) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid V-Code'
            ]);
        }
        $visitorId = $visitor['id'];

        // 🔹 Check active log (decides action)
        $activeLog = $logModel
            ->where('visitor_request_id', $visitorId)
            ->where('check_out_time IS NULL', null, false)
            ->first();