app/Controllers/User.php

    public function create()
    {
        $userModel = new UserModel();

        // Read form input
        $data = [
            'company_name'  => $this->request->getPost('company_name'),
            'department_id' => $this->request->getPost('department_id'),
            'username'      => $this->request->getPost('username'),
            'password'      => md5($this->request->getPost('password').'HASHKEY123'), // store md5
            'role_id'       => $this->request->getPost('role_id'),
            'hash_key'      => 'HASHKEY123', // random hash
            'created_by'    => session()->get('user_id'), // current logged user
            'created_at'    => date('Y-m-d H:i:s')
        ];

        // Insert into DB
        if ($userModel->insert($data)) {
---
INSERT INTO `users` (`company_name`, `department_id`, `username`, `password`, `role_id`, `hash_key`, `created_by`, `created_at`) VALUES ('UKMPL', '2', 'admin', '202cb962ac59075b964b07152d234b70', '2', '107e683363f08a196355475b46291be5', '1', '2025-11-21 11:06:57')