app/Controllers/VisitorRequest.php

    public function submit()
    {
        if (!$this->request->isAJAX()) return;

        // Uploads
        $vehicleID = $this->uploadFile($this->request->getFile('vehicle_id_proof'), 'public/uploads/vehicle');
        $visitorID = $this->uploadFile($this->request->getFile('visitor_id_proof'), 'public/uploads/visitor');

        // Auto codes
        $codeGen   = new GenerateCodesController();
        $vCode     = $codeGen->generateVisitorsCode();
        $groupCode = $codeGen->generateGroupVisitorsCode();

        $status = (session()->get('role_id') <= 2) ? "approved" : "pending";

        // Generate QR
        $qrFile = ($status === 'approved') ? $this->generateQRcode($vCode) : "";

        /* =======================================================
        STEP 1 — INSERT INTO visitor_request_header FIRST
        ======================================================= */

        $headerData = [
            'header_code'     => $groupCode,
            'requested_by'    => session()->get('user_id'),
            'requested_date'  => $this->request->getPost('visit_date'),
            'requested_time'  => $this->request->getPost('visit_time'),
            'department'      => session()->get('department_name'),
            'company'      => session()->get('company_name'),
            'total_visitors'  => 1,
            'status'          => $status,
            'remarks'         => '',
            'purpose'         => $this->request->getPost('purpose'),
            'description'         => $this->request->getPost('description'),
            'email'         => $this->request->getPost('visitor_email'),
        ];
---
SELECT *
FROM `visitors`
ORDER BY `id` DESC

        'updated_by'         => $autoApprove ? session()->get('user_id') : ''
    ];

      $headerId = $this->VisitorRequestHeaderModel->insert($headerData);
---
INSERT INTO `visitor_request_header` (`header_code`, `requested_by`, `requested_date`, `requested_time`, `department`, `company`, `total_visitors`, `status`, `remarks`, `purpose`, `description`, `email`, `created_at`, `updated_at`) VALUES ('GV000022', '1', '2025-12-08', '15:50', 'IT', 'UKMPL', 2, 'approved', '', 'Document Submission', 'Test', 'test@gmail.com', '2025-12-08 15:51:22', '2025-12-08 15:51:22')

            'created_by'        => session()->get('user_id'),
        ];

        $vRequestId = $this->visitorModel->insert($data);
---
INSERT INTO `visitors` (`group_code`, `v_code`, `request_header_id`, `visitor_name`, `visitor_email`, `visitor_phone`, `purpose`, `proof_id_type`, `proof_id_number`, `visit_date`, `visit_time`, `description`, `vehicle_no`, `vehicle_type`, `vehicle_id_proof`, `visitor_id_proof`, `host_user_id`, `status`, `qr_code`, `created_by`) VALUES ('GV000022', 'V000031', 22, 'Prakash', 'john@example.com', '9876543210', 'Document Submission', 'Aadhaar Card', '123456789012', '2025-12-08', '15:50', 'Test', 'TN10AB1234', 'Car', '', '', '1', 'approved', 'visitor_V000031_qr.png', '1')