app/Controllers/VisitorRequest.php

SELECT *
FROM `users`
WHERE `role_id` = 2
AND `department_id` = '6'
ORDER BY `priority` ASC
---
    public function index(): string
    {
        $session = session();

        $dep_id     = $session->get('dep_id');
        $role_id    = $session->get('role_id');
        $user_id    = $session->get('user_id');

        $userModel = new \App\Models\UserModel();

        // CASE 1: Super Admin (role_id = 1) → Show ALL Admins ordered by priority
        if ($role_id == 1) {
            $admins = $userModel
                        ->where('role_id', 2)
                        ->orderBy('priority', 'ASC')
                        ->findAll();
        }
        // CASE 2: Admin (role_id = 2) → Show ONLY same department admins ordered by priority
        else {
            $admins = $userModel
                        ->where('role_id', 2)
                        ->where('department_id', $dep_id)
                        ->orderBy('priority', 'ASC')
                        ->findAll();

SELECT *
FROM `visitor_request_header`
ORDER BY `id` DESC
---
    public function visitorData()
    {
            $role = session()->get('role_id');
            $uid  = session()->get('user_id');

            $query = $this->VisitorRequestHeaderModel
                        ->orderBy('id', 'DESC');