app/Controllers/VisitorRequest.php


            // ---------- LOG ENTRY ----------
            $logModel = new \App\Models\VisitorLogModel();
            $logModel->insert([
                'visitor_request_id' => $vRequestId,
                'action_type'        => 'Created',
                'old_status'         => null,
                'new_status'         => 'pending',
                'remarks'            => '--',
                'performed_by'       => session()->get('user_id'),
            ]);
---
INSERT INTO `visitor_logs` (`visitor_request_id`, `action_type`, `old_status`, `new_status`, `remarks`, `performed_by`) VALUES (31, 'Created', NULL, 'approved', '--', '1')

    public function visitorData()
    {
            // if ($this->request->isAJAX()) {

                $visitorModel = new \App\Models\VisitorRequestModel();
                $data = $visitorModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `visitors`
ORDER BY `id` DESC